blog/2020/08/organizing-research/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-25 Tue 05:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Organizing Research</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Organizing Research Papers"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Organizing Research</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf68b10b">Goals, Requirements, and Motivation</a>
<ul>
<li><a href="#org05f5450">Meaningful Filenames</a></li>
<li><a href="#org8d38ec6">DOI or Referencing Material for Cross Referencing and Linking</a></li>
</ul>
</li>
<li><a href="#org6d7c183">Proposals</a>
<ul>
<li><a href="#org59dd44f">Zotero</a></li>
<li><a href="#org3fefb73">Org Mode with Org Attach</a></li>
<li><a href="#orgb3c5c38">Org-ref</a></li>
</ul>
</li>
<li><a href="#org0363f50">Discussion</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Small tangent into the basic, how to organize research papers and related
artifacts.  I have a few ideas for how to best handle this, but nothing
concrete I can point to that I'm satisfied with.
</p>

<p>
Is this a useless divergence into tool sharpening and small optimizations for
little gain?  Or is this a worthwhile venture to get right early on that pays
off in the long term?
</p>

</div>

<p>
As I'm starting to dive into the "literature", as it might occasionally be
referred to, there is a certain amassing of papers to read.  Worse, there tends
to be a mixed bag of advice for handling the fire hose of information and how
to not drown in the deluge of papers that tends to accompany research.
</p>

<p>
There are certainly a myriad of different approaches to solving this problem.
I have been debating a few approaches and would like to describe them and,
ideally, exposit my way towards a final solution.
</p>

<div id="outline-container-orgf68b10b" class="outline-2">
<h2 id="orgf68b10b">Goals, Requirements, and Motivation</h2>
<div class="outline-text-2" id="text-orgf68b10b">
<p>
There are several goals and basic requirements of any organization system, here
is no exception.  While these goals may be personal, knowing the motivation
behind the approaches that follow, the decisions may make more sense.  With a
different set of goals and requirements, perhaps the following <span class="underline">won't</span> make
sense.
</p>
</div>

<div id="outline-container-org05f5450" class="outline-3">
<h3 id="org05f5450">Meaningful Filenames</h3>
<div class="outline-text-3" id="text-org05f5450">
<p>
The underlying structure and naming of files should be agnostic to any specific
application that "manages" them.  That is, the filenames and overall directory
structure should mirror that of the organization within an application.  I want
to be able to simply browse the files in a regular file explorer on occasion.
Furthermore, copying files to, say, an e-reader with limited metadata
capabilities similarly benefits from the foundation of the organization being
in the filesystem itself.
</p>
</div>
</div>

<div id="outline-container-org8d38ec6" class="outline-3">
<h3 id="org8d38ec6">DOI or Referencing Material for Cross Referencing and Linking</h3>
<div class="outline-text-3" id="text-org8d38ec6">
<p>
The organization system will need access to the <a href="https://www.doi.org">digital object identifier (DOI)</a>
of the paper as it may be needed for later queries such as citations and
derivative work.  Since there is no clear universal <a href="https://www.doi.org">DOI</a> format used between
various journals and conferences, e.g., <a href="https://acm.org">ACM</a> and <a href="https://citeseerx.ist.psu.edu/index">CiteSeerX</a> use different formats
for <a href="https://www.doi.org">DOI</a>, I'm not especially concerned with <a href="https://www.doi.org">DOI</a> information being part of the
filename.  Regardless, this information should be available when needed.
</p>

<p>
Similarly, the <a href="http://www.bibtex.org/">BibTeX</a> should be available immediately as well.  To some degree,
the <a href="http://www.bibtex.org/">BibTeX</a> is more important than the raw <a href="https://www.doi.org">DOI</a> information.
</p>

<p>
Simply, information should be stored to enable a workflow of querying for a
list of citations and derivative work.
</p>
</div>
</div>
</div>

<div id="outline-container-org6d7c183" class="outline-2">
<h2 id="org6d7c183">Proposals</h2>
<div class="outline-text-2" id="text-org6d7c183">
<p>
There are several possibilities worth investigating.
</p>

<p>
Regardless of the approach, however, something does seem immediately obvious:
no system will work without front-loading the work of organization when a paper
or artifact is under consideration.  Handling the organization tasks in batches or
letting the organization slip for even a moment may kill the entire system.
</p>

<p>
If there's already a large collection of papers, it will be very difficult to
retroactively organize everything.
</p>
</div>

<div id="outline-container-org59dd44f" class="outline-3">
<h3 id="org59dd44f">Zotero</h3>
<div class="outline-text-3" id="text-org59dd44f">
<p>
<a href="https://www.zotero.org/">Zotero</a> is a free and open source platform for managing research.  It's
available in a desktop application and a online web application.  I've only
considered the former and know very little about the latter.
</p>

<p>
<a href="https://www.zotero.org/">Zotero</a> is an intuitive tool that has a lot of good features.  It can
automatically pull metadata for articles, it can generate citations, the choice
of organization is on the user, file syncing can be achieved without having to
use their hosted service, it can archive/snapshot a web page, and, an implicit
requirement, it's free and open source software!
</p>

<p>
However, I have several issues that dissuade me from using it for my purposes.
Chiefly, the file organization on disk is opaque, therefore, it fails to
satisfy the first requirement above.  Furthermore, the generated <a href="http://www.bibtex.org/">BibTeX</a>
references are not as complete as I would like.  Moreover, the process of
pulling references for a new manuscript each time does not seem pleasant.
</p>
</div>
</div>

<div id="outline-container-org3fefb73" class="outline-3">
<h3 id="org3fefb73">Org Mode with Org Attach</h3>
<div class="outline-text-3" id="text-org3fefb73">
<p>
Another approach would be to use <a href="https://orgmode.org">Org mode</a>.  Specifically, use <a href="https://orgmode.org">Org mode</a> as an
"index" into the files, while maintaining the filesystem structure desired as
per the first requirement.  This can be further augmented by using
"attachments" from <a href="https://orgmode.org">Org mode</a>.
</p>

<p>
For example, the workflow for this may be something like the following:
</p>

<ol class="org-ol">
<li>Downloading a paper, rename it with the full title, the last name of the
first author, and the year of publication, all separated by hyphens, all
lowercase.</li>

<li>Create an entry in the appropriate <a href="https://orgmode.org">Org</a> entry for the paper.</li>

<li>Download and add the <a href="http://www.bibtex.org/">BibTeX</a> citation to a <code>references.bib</code> file.</li>

<li>Using <a href="https://github.com/jkitchin/org-ref"><code>org-ref</code>,</a> add a "citation" so that the article can be easily cited or
its reference material retrieved later.</li>

<li>Use <a href="https://orgmode.org/manual/Attachments.html"><code>org-attach</code></a> to copy the file into the appropriate directory tree.</li>
</ol>

<p>
This process can likely be augmented and idealized via <a href="https://orgmode.org/manual/Capture%20.html">Capture Templates</a>.
However, I have not yet explored this in depth since I have a few concerns that
still need to be addressed regarding this solution.
</p>

<p>
I can specifically override the directory used for <a href="https://orgmode.org/manual/Attachments.html">Attachments</a> for specific
entries, however, this may be an overwhelming exercise that needs to be
duplicated many times and manually maintained .  Again, <a href="https://orgmode.org/manual/Capture%20.html">Org Capture and
templates</a> may be helpful in better realizing the solution, but certainly
further exploration is necessary.
</p>
</div>
</div>

<div id="outline-container-orgb3c5c38" class="outline-3">
<h3 id="orgb3c5c38">Org-ref</h3>
<div class="outline-text-3" id="text-orgb3c5c38">
<p>
<a href="https://engineering.cmu.edu/directory/bios/kitchin-john.html">John Kitchin of CMU</a> created <a href="https://github.com/jkitchin/org-ref">Org-Ref</a>, a reference system for <a href="https://orgmode.org">Org Mode</a> that
better integrates <a href="http://www.bibtex.org/">BibTeX</a> citations than <a href="https://orgmode.org/manual/Hyperlinks.html">Org Links</a>.  Really, <a href="https://github.com/jkitchin/org-ref">Org-Ref</a> and the
<a href="https://orgmode.org/manual/Hyperlinks.html">linking system</a> of <a href="https://orgmode.org">Org</a> are not even in the same ballpark.
</p>

<p>
There is a lot of nice features to <a href="https://github.com/jkitchin/org-ref">Org Ref</a>: a suite of utilities for
downloading and automatically creating <a href="http://www.bibtex.org/">BibTeX</a> entries from the <a href="https://www.doi.org">DOI</a> or even the
PDF itself, among others.  It can automatically download and save the PDF into
a specified directory.  <a href="https://github.com/jkitchin/org-ref">Org-Ref</a> also nicely handles the process of adding
citations to the manuscript during the writing phase.
</p>

<p>
I'm not specifically sure how <a href="https://github.com/jkitchin/org-ref">Org-Ref</a> handles saving the PDF files, how it
names them or otherwise organize these on disk.  Given the more automatic
nature of <a href="https://github.com/jkitchin/org-ref">Org-Ref</a>, it certainly warrants further investigation.
</p>
</div>
</div>
</div>

<div id="outline-container-org0363f50" class="outline-2">
<h2 id="org0363f50">Discussion</h2>
<div class="outline-text-2" id="text-org0363f50">
<p>
I'm still debating these different solutions.  I don't want to spend a ton of
time optimizing this as there are a lot of other tasks that are more important
than tool sharpening.
</p>

<p>
There likely exists an idealized solution in the hybrid space between
<a href="https://orgmode.org/manual/Capture%20.html">Org Capture</a> and <a href="https://github.com/jkitchin/org-ref">Org-Ref</a>, but it all requires some more investigation.
</p>

<p>
One reason I wanted to write about this is that I feel these kinds of topics
aren't given the attention they probably should receive.  Perhaps it's an
uninteresting problem.  Perhaps it's too dependent on personal preferences.
Regardless though, there seems to be very little discussion on the subject.  If
there are discussions on the topic, they seem to exist in an ephemeral space of
the internet or the air on which they were verbally transmitted.
</p>

<p>
The solutions proposed here are certainly not universally appropriate and I by
no means make any such claim.  But the solutions proposed seem appropriate and
helpful to me.  Perhaps they may be helpful to someone else.  But further than
that, it's hopefully a small step in a larger pattern of sharing tips and
personal workflows to help others along similar journeys.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
